In [1]:
# Pandas 라이브러리 불러오기
import pandas as pd

# Customer 데이터 읽기
customer = pd.read_csv('/Users/geonseunglee/Desktop/R/github/R_n_Python/data/Customer.csv')

### customer 데이터 확인 및 결측치 확인

In [2]:
# information
customer.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5647 entries, 0 to 5646
Data columns (total 4 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   customer_Id  5647 non-null   int64
 1   DOB          5647 non-null   object
 2   Gender       5645 non-null   object
 3   city_code    5645 non-null   float64
dtypes: float64(1), int64(1), object(2)
memory usage: 176.6+ KB

In [3]:
customer.head()

   customer_Id         DOB Gender  city_code
0       268408  02-01-1970      M        4.0
1       269696  07-01-1970      F        8.0
2       268159  08-01-1970      F        8.0
3       270181  10-01-1970      F        2.0
4       268073  11-01-1970      M        1.0

In [4]:
# 각 컬럼별 결측치 수 확인
customer.isnull().sum()

customer_Id    0
DOB            0
Gender         2
city_code      2
dtype: int64

In [5]:
## 결측치 데이터 확인
# Gender 결측치
customer[customer["Gender"].isnull()]

    customer_Id         DOB Gender  city_code
24       267199  14-02-1970    NaN        2.0
87       271626  02-06-1970    NaN        6.0

In [6]:
# 결측치를 알 수 없음의 의미로 'unknown'으로 변경하기
customer["Gender"] = customer["Gender"].fillna("unknown")

## 성별 데이터 집계
customer.groupby("Gender").count()["customer_Id"]

Gender
F          2753
M          2892
unknown       2
Name: customer_Id, dtype: int64

In [7]:
# city_code 결측치
customer[customer["city_code"].isnull()]

     customer_Id         DOB Gender  city_code
115       268447  14-07-1970      M        NaN
149       268709  09-09-1970      F        NaN

In [8]:
## city_code 데이터 집계 (내림차순 정렬))
customer.groupby("city_code").count()["customer_Id"].sort_values(ascending=False)

city_code
3.0     595
5.0     586
4.0     582
7.0     575
2.0     564
8.0     562
10.0    558
1.0     551
9.0     546
6.0     526
Name: customer_Id, dtype: int64

In [9]:
## 결측치를 city_code 최대값 지역인 3으로 임의로 부여하기
customer["city_code"] = customer["city_code"].fillna(3)

# city_code 결측치
customer[customer["city_code"].isnull()]

Empty DataFrame
Columns: [customer_Id, DOB, Gender, city_code]
Index: []

In [10]:
## 성별 데이터 집계 (내림차순 정렬))
customer.groupby("city_code").count()["customer_Id"].sort_values(ascending=False)

city_code
3.0     597
5.0     586
4.0     582
7.0     575
2.0     564
8.0     562
10.0    558
1.0     551
9.0     546
6.0     526
Name: customer_Id, dtype: int64

In [11]:
## 최종적으로 각 컬럼의 결측치 수 확인하기
customer.isnull().sum()

customer_Id    0
DOB            0
Gender         0
city_code      0
dtype: int64